test_cases/drl_control_cylinder/env/base_case/test_policy/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("../../../agentRotatingWallVelocity/libAgentRotatingWallVelocity.so");

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8.0;

deltaT          5.0e-4;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        // write control gets ignored, not clear why
        writeControl    timeStep;
        writeInterval   20;
        // start time is excepted
        timeStart       0.0;
        log false;

        patches
        (
            cylinder
        );

        rhoInf      1;
        rho         rhoInf;

        CofR        (0.2 0.2 0.005);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        //pitchAxis   (0 0 1);
        magUInf     1.0;
        lRef        0.1;
        Aref        0.001;
    }
}

// ************************************************************************* //
